`timescale 1ns / 1ps

module Dec7Seg(
        input logic [7:0] x,
        output logic [7:0] a2g 
    ); 
 
    assign AN = 4'b0000;

    always_comb
        case (x) 
            'h00: a2g = 8'b00000011;    //数字并且不显示小数点，下同
            'h01: a2g = 8'b10011111; 
            'h02: a2g = 8'b00100101; 
            'h03: a2g = 8'b00001101; 
            'h04: a2g = 8'b10011001; 
            'h05: a2g = 8'b01001001; 
            'h06: a2g = 8'b01000001; 
            'h07: a2g = 8'b00011111; 
            'h08: a2g = 8'b00000001; 
            'h09: a2g = 8'b00001001;  
            'h0a: a2g = 8'b00010001; 
            'h0b: a2g = 8'b11000001; 
            'h0c: a2g = 8'b01100011; 
            'h0d: a2g = 8'b10000101; 
            'h0e: a2g = 8'b01100001; 
            'h0f: a2g = 8'b01110001;
            'h10: a2g = 8'b00000010;    //数字并且显示小数点，下同 
            'h11: a2g = 8'b10011110; 
            'h12: a2g = 8'b00100100; 
            'h13: a2g = 8'b00001100; 
            'h14: a2g = 8'b10011000; 
            'h15: a2g = 8'b01001000; 
            'h16: a2g = 8'b01000000; 
            'h17: a2g = 8'b00011110; 
            'h18: a2g = 8'b00000000; 
            'h19: a2g = 8'b00001000;  
            'h1a: a2g = 8'b00010000; 
            'h1b: a2g = 8'b11000000; 
            'h1c: a2g = 8'b01100010; 
            'h1d: a2g = 8'b10000100; 
            'h1e: a2g = 8'b01100000; 
            'h1f: a2g = 8'b01110000;
            'hff: a2g = 8'b11101101;    //显示等号
        default: a2g = 8'b00000000;     //完全显示
        endcase 
endmodule
